Revit 2027 API
OffsetSurface.GetOffsetDistance Method
 Returns offset distance of this OffsetSurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetOffsetDistance()
Public Function GetOffsetDistance As Double
public:
double GetOffsetDistance()
member GetOffsetDistance : unit -> float
Return Value
Double
 Offset distance of this OffsetSurface.
See Also
Reference
OffsetSurface Class
Autodesk.Revit.DB Namespace